<a href="https://colab.research.google.com/github/Fabriciome/Tarefas-Awari/blob/main/Manipulacao_dados_mercado_livre.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [50]:
#importando as bibliotecas
import pandas as pd
import numpy as np

In [51]:
#buscando o arquivo de dados coletados do Mercado Livre
url = 'https://raw.githubusercontent.com/Fabriciome/Tarefas-Awari/main/dados_mercado_livre.csv'
df_ml = pd.read_csv(url, thousands='.')

In [52]:
df_ml.head()

   aluguel                 area_quarto zona
0     2000  51 m² construídos2 quartos  sul
1     2700  72 m² construídos3 quartos  sul
2     3200   59 m² construídos1 quarto  sul
3     1300  70 m² construídos2 quartos  sul
4     1800  90 m² construídos2 quartos  sul

In [23]:
df_ml.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1152 entries, 0 to 1151
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   aluguel      1152 non-null   int64
 1   area_quarto  1152 non-null   object
 2   zona         1152 non-null   object
dtypes: int64(1), object(2)
memory usage: 27.1+ KB

In [24]:
df_ml.describe().T

          count         mean          std  ...     50%     75%      max
aluguel  1152.0  2341.382812  1517.385548  ...  1900.0  2813.0  15000.0

[1 rows x 8 columns]

In [25]:
df_ml.isna().sum()

aluguel        0
area_quarto    0
zona           0
dtype: int64

In [26]:
df_ml.isnull().sum()

aluguel        0
area_quarto    0
zona           0
dtype: int64

In [28]:
df_ml['aluguel'] = df_ml['aluguel'].astype(float)

In [29]:
df_ml.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1152 entries, 0 to 1151
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   aluguel      1152 non-null   float64
 1   area_quarto  1152 non-null   object
 2   zona         1152 non-null   object
dtypes: float64(1), object(2)
memory usage: 27.1+ KB

In [30]:
linha0 = df_ml['area_quarto'][0]

In [31]:
linha0.split(sep=' m²')[0]

'51'

In [32]:
linha_inventada = ' 2 quartos'

In [33]:
if 'm²' in linha0:
  print(linha0.split(sep=' m²')[0])
else:
  print(np.nan)

51

In [34]:
if 'm²' in linha_inventada:
  print(linha_inventada.split(sep=' m²')[0])
else:
  print(np.nan)

nan

In [36]:
def extrair_area(entrada):
  if 'm²' in entrada:
    area = entrada.split(sep=' m²')[0]
  else:
    area = np.nan
  return area

In [38]:
df_ml['area'] = df_ml['area_quarto'].apply(extrair_area).astype(float)

In [39]:
df_ml.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1152 entries, 0 to 1151
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   aluguel      1152 non-null   float64
 1   area_quarto  1152 non-null   object
 2   zona         1152 non-null   object
 3   area         1152 non-null   float64
dtypes: float64(2), object(2)
memory usage: 36.1+ KB

In [40]:
linha0

'51 m² construídos2 quartos'

In [41]:
padrao = '(\d+)'

In [42]:
import re

In [43]:
re.findall(padrao, linha0)[1]

'2'

In [44]:
def extrair_quarto(entrada):
  padrao = '(\d+)' 

  if 'quarto' in entrada:
    quarto = re.findall(padrao, entrada)[1]
  else:
    quarto = np.nan
  return quarto

In [45]:
df_ml['quarto'] = df_ml['area_quarto'].apply(extrair_quarto).astype(float)

In [46]:
df_ml.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1152 entries, 0 to 1151
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   aluguel      1152 non-null   float64
 1   area_quarto  1152 non-null   object
 2   zona         1152 non-null   object
 3   area         1152 non-null   float64
 4   quarto       1152 non-null   float64
dtypes: float64(3), object(2)
memory usage: 45.1+ KB

In [47]:
df_ml = df_ml.drop('area_quarto', axis=1)

In [48]:
df_ml.head()

   aluguel zona  area  quarto
0   2000.0  sul  51.0     2.0
1   2700.0  sul  72.0     3.0
2   3200.0  sul  59.0     1.0
3   1300.0  sul  70.0     2.0
4   1800.0  sul  90.0     2.0

In [64]:
df_ml.to_csv('dados_tratados_ml.csv', index=False)

In [60]:
pd.read_csv('https://raw.githubusercontent.com/Fabriciome/Tarefas-Awari/main/dados_tratados_mercado_livre.csv')

      aluguel   zona   area  quarto
0      2000.0    sul   51.0     2.0
1      2700.0    sul   72.0     3.0
2      3200.0    sul   59.0     1.0
3      1300.0    sul   70.0     2.0
4      1800.0    sul   90.0     2.0
...       ...    ...    ...     ...
1147   1100.0  oeste   40.0     1.0
1148   8500.0  oeste  173.0     3.0
1149   2500.0  oeste   68.0     2.0
1150   1970.0  oeste   95.0     2.0
1151   1500.0  oeste   33.0     1.0

[1152 rows x 4 columns]